# Sesión 4 Pandas Tipos operaciones

In [7]:
import numpy as np
import pandas as pd

from datetime import date, time, datetime
from datetime import timedelta


* ```object``` el cual representa a una cadena de caracteres.
* ```int64``` es el tipo para números enteros. 
* ```float64``` es el tipo para números de punto flotante.
* ```bool``` es el tipo para valores booleanos.
* ```datetime64``` es el tipo usado para gestionar fechas y horas.
* ```timedelta``` es el tipo de diferencias de tiempo. 
* ```category``` es un tipo de dato que contiene una colección finita de posibles valores

## Funciones de fecha

Los tipos de datos date, time y datetime

* `date`(año, mes, dia) : Devuelve un objeto de tipo date que representa la fecha con el año, mes y dia indicados.
* `time`(hora, minutos, segundos, microsegundos) : Devuelve un objeto de tipo time que representa un tiempo la hora, minutos, segundos y microsegundos indicados.
* `datetime`(año, mes, dia, hora, minutos, segundos, microsegundos) : Devuelve un objeto de tipo datetime que representa una fecha y hora con el año, mes, dia, hora, minutos, segundos y microsegundos indicados.

In [8]:
datos = pd.DataFrame({'nombres':('Carlos Ayala',
                                 'Martha Sánchez'
                                 , 'Jimena Ríos',
                                 'Raul Quiroz'),
            'fechas':(date(year=1995, month=12, day=21), 
                      date(year=1989, month=1, day=13), 
                      date(year=1992, month=9, day=14), 
                      date(year=1993, month=7, day=8)),
            'saldo': (3600, 
                      7452, 
                      np.NaN, 
                      12143.5),
            'al corriente':(True, 
                            True, 
                            False, 
                            True)})

datos

          nombres      fechas    saldo  al corriente
0    Carlos Ayala  1995-12-21   3600.0          True
1  Martha Sánchez  1989-01-13   7452.0          True
2     Jimena Ríos  1992-09-14      NaN         False
3     Raul Quiroz  1993-07-08  12143.5          True

Convertir un objecto de pandas a un tipo

In [10]:
datos.dtypes

nombres          object
fechas           object
saldo           float64
al corriente       bool
dtype: object

In [11]:
datos2 = datos.astype(str)
datos2.dtypes

nombres         object
fechas          object
saldo           object
al corriente    object
dtype: object

In [17]:
datos2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   nombres       4 non-null      object
 1   fechas        4 non-null      object
 2   saldo         4 non-null      object
 3   al corriente  4 non-null      object
dtypes: object(4)
memory usage: 256.0+ bytes

In [18]:
datos2

          nombres      fechas    saldo al corriente
0    Carlos Ayala  1995-12-21   3600.0         True
1  Martha Sánchez  1989-01-13   7452.0         True
2     Jimena Ríos  1992-09-14      nan        False
3     Raul Quiroz  1993-07-08  12143.5         True

In [19]:
datos2['saldo'].astype('float')

0     3600.0
1     7452.0
2        NaN
3    12143.5
Name: saldo, dtype: float64

In [20]:
fechas = pd.DataFrame({'year': [1997, 1982, 1985],
                       'month': [1, 12, 3],
                       'day': [14, 5, 21],
                       'hour':[17, 0, 4],
                       'minutes':[45, 39, 28],
                      'seconds':[11.1803, 23.74583, 3.8798]})

In [21]:
fechas

   year  month  day  hour  minutes   seconds
0  1997      1   14    17       45  11.18030
1  1982     12    5     0       39  23.74583
2  1985      3   21     4       28   3.87980

In [22]:
pd_fechas = pd.to_datetime(fechas)
pd_fechas

0   1997-01-14 17:45:11.180300
1   1982-12-05 00:39:23.745830
2   1985-03-21 04:28:03.879800
dtype: datetime64[ns]

In [23]:
pd_fechas.info()

<class 'pandas.core.series.Series'>
RangeIndex: 3 entries, 0 to 2
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 152.0 bytes

In [24]:
pd.to_numeric(pd_fechas)

0    853263911180300000
1    407896763745830000
2    480227283879800000
dtype: int64

In [28]:
datos3 = pd.DataFrame(np.arange(8532639111803, 8532639111903, 5).reshape(10,2))
datos3

               0              1
0  8532639111803  8532639111808
1  8532639111813  8532639111818
2  8532639111823  8532639111828
3  8532639111833  8532639111838
4  8532639111843  8532639111848
5  8532639111853  8532639111858
6  8532639111863  8532639111868
7  8532639111873  8532639111878
8  8532639111883  8532639111888
9  8532639111893  8532639111898

In [31]:
pd.to_datetime(datos3[1])

0   1970-01-01 02:22:12.639111808
1   1970-01-01 02:22:12.639111818
2   1970-01-01 02:22:12.639111828
3   1970-01-01 02:22:12.639111838
4   1970-01-01 02:22:12.639111848
5   1970-01-01 02:22:12.639111858
6   1970-01-01 02:22:12.639111868
7   1970-01-01 02:22:12.639111878
8   1970-01-01 02:22:12.639111888
9   1970-01-01 02:22:12.639111898
Name: 1, dtype: datetime64[ns]

Operaciones básicas con dataframes

In [32]:
datos4 = pd.DataFrame(np.arange(20).reshape(5,4), columns=['primero', 'segundo', 'tercero', 'cuarto'])
datos4

   primero  segundo  tercero  cuarto
0        0        1        2       3
1        4        5        6       7
2        8        9       10      11
3       12       13       14      15
4       16       17       18      19